Data Encoding:

data encoding means converting categorical (text) data into numerical form so 
that machine learning models can understand and use it.

types of data encoding:

1. Label Encoding(Categorical to Numerical)
2. One-Hot Encoding(Nominal/one)
3. target guided ordinal encoding(Ordinal)

1)Nomainal or One hot encoding:

Nominal encoding is a technique used to transform categorical variables that have no intrinsic ordering into numerical values that can be used in machine learning models. One common method for nominal encoding is one-hot encoding, which creates a binary vector for each category in the variable.

diadvantage:

a. Sparse matrix[overfitting]

b.it increses the no. of categories

In [31]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd

In [32]:
df=pd.DataFrame({
    'color':['red','blue','green','green','blue','red']
    })

In [33]:
df

   color
0    red
1   blue
2  green
3  green
4   blue
5    red

In [34]:
#create an instance of OneHotEncoder
encoder=OneHotEncoder()

In [35]:
encoded=encoder.fit_transform(df[['color']])

In [36]:
import pandas as pd
encoded_df = pd.DataFrame(encoded.toarray(), columns=encoder.get_feature_names_out())

In [37]:
pd.concat([df,encoded_df], axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4   blue         1.0          0.0        0.0
5    red         0.0          0.0        1.0

In [38]:
import seaborn as sns

In [39]:
df=sns.load_dataset('tips')

In [40]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [41]:
from sklearn.preprocessing import OneHotEncoder

In [42]:
encoder=OneHotEncoder()

In [43]:
encoded=encoder.fit_transform(df[['day']])

In [44]:
import pandas as pd
encoded_df=pd.DataFrame(encoded.toarray(), columns=encoder.get_feature_names_out(['day']))

In [45]:
encoded_df

     day_Fri  day_Sat  day_Sun  day_Thur
0        0.0      0.0      1.0       0.0
1        0.0      0.0      1.0       0.0
2        0.0      0.0      1.0       0.0
3        0.0      0.0      1.0       0.0
4        0.0      0.0      1.0       0.0
..       ...      ...      ...       ...
239      0.0      1.0      0.0       0.0
240      0.0      1.0      0.0       0.0
241      0.0      1.0      0.0       0.0
242      0.0      1.0      0.0       0.0
243      0.0      0.0      0.0       1.0

[244 rows x 4 columns]

In [46]:
pd.concat([df,encoded_df], axis=1)

,total_bill,tip,sex,smoker,day,time,size,day_Fri,day_Sat,day_Sun,day_Thur
0,16.99,1.01,Female,No,Sun,Dinner,2,0.0,0.0,1.0,0.0
1,10.34,1.66,Male,No,Sun,Dinner,3,0.0,0.0,1.0,0.0
2,21.01,3.50,Male,No,Sun,Dinner,3,0.0,0.0,1.0,0.0
3,23.68,3.31,Male,No,Sun,Dinner,2,0.0,0.0,1.0,0.0
4,24.59,3.61,Female,No,Sun,Dinner,4,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,0.0,1.0,0.0,0.0
240,27.18,2.00,Female,Yes,Sat,Dinner,2,0.0,1.0,0.0,0.0
241,22.67,2.00,Male,Yes,Sat,Dinner,2,0.0,1.0,0.0,0.0
242,17.82,1.75,Male,No,Sat,Dinner,2,0.0,1.0,0.0,0.0
243,18.78,3.00,Female,No,Thur,Dinner,2,0.0,0.0,0.0,1.0

Label and Ordinal Encoding

In [47]:
import pandas as pd

In [48]:
from sklearn.preprocessing import LabelEncoder

In [49]:
df=pd.DataFrame({
    'color':['red','blue','green','green','blue','red']
    })

In [50]:
df

   color
0    red
1   blue
2  green
3  green
4   blue
5    red

In [52]:
#create an instance of lebel encoder
encoder=LabelEncoder()

In [55]:
encoder.fit_transform(df['color'])

array([2, 0, 1, 1, 0, 2])

In lebel encoder Automatically assigns numbers based on alphabetical order.

while in ordinal encoder User defines the correct order.

In [57]:
#ordinal encoding
from sklearn.preprocessing import OrdinalEncoder
#create a sample dataframe with an ordinal variable
df=pd.DataFrame({
    'size':['small','medium','large','medium','small','large']})

In [58]:
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [59]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

Target guided ordinal Encoding:

Its a technique used to encode categorical variables based on their relationship with the target variable. This encoding technique is useful when we have a categorical variabile with a large number of unique callegories, and we want to use this variable as a feature in our machine ming model

In Targest Guided Ordinal Encoding, we replace each callegory in the categorical variable with a numerical value based on the mean or median of the target variatile for that category. This creates a monotonic relationship between the categorical variable and the target variable, which can improve the predictive power of our model.

In [61]:
import pandas as pd
df=pd.DataFrame({
    'city':['New york','London','Paris','Tokyo','New york','Paris'],
    'price':[200,150,300,250,180,320]
})

In [62]:
df.head()

       city  price
0  New york    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New york    180

In [65]:
#calculate the mean price for each city
mean_price=df.groupby('city')['price'].mean().to_dict()

In [66]:
mean_price

{'London': 150.0, 'New york': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [67]:
## replece city with mean price
df['city_encoded']=df['city'].map(mean_price)

In [68]:
df

       city  price  city_encoded
0  New york    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New york    180         190.0
5     Paris    320         310.0

Covariance and Correlation

In [1]:
import seaborn as sns

In [3]:
df=sns.load_dataset('healthexp')
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [7]:
#Covariance
df.cov(numeric_only=True)

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

In [8]:
##Pearson correlation
df.corr(numeric_only=True, method='pearson')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

In [9]:
##spearman correlation
df.corr(numeric_only=True, method='spearman')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.931598         0.896117
Spending_USD     0.931598      1.000000         0.747407
Life_Expectancy  0.896117      0.747407         1.000000